app/services/world_cup_sync.rb

SELECT COUNT(*) FROM "matches"
SELECT COUNT(*) FROM "standings"
SELECT COUNT(*) FROM "teams"
---
  def sync_all
    log "Starting full World Cup sync..."
    sync_teams
    sync_fixtures
    sync_standings
    log "Sync complete. Teams: #{Team.count}, Matches: #{Match.count}, Standings: #{Standing.count}"

SELECT "teams".* FROM "teams" WHERE "teams"."external_id" = 1118 LIMIT 1
SELECT "standings".* FROM "standings" WHERE "standings"."team_id" = 57 LIMIT 1
INSERT INTO "standings" ("team_id", "played", "won", "drawn", "lost", "goals_for", "goals_against", "points", "rank", "group_name", "created_at", "updated_at") VALUES (57, 3, 2, 1, 0, 5, 1, 7, 1, 'A', '2026-06-03 00:52:01.873453', '2026-06-03 00:52:01.873453') RETURNING "id"
---
  def sync_standings
    data = @api.standings
    groups = data.dig(0, "league", "standings") || []
    log "Syncing standings for #{groups.length} groups..."

    groups.each do |group|
      group.each do |entry|
        team = Team.find_by(external_id: entry.dig("team", "id"))
        next unless team

        Standing.find_or_initialize_by(team: team).tap do |s|
          s.group_name    = entry["group"]&.gsub("Group ", "")
          s.rank          = entry["rank"]
          s.played        = entry.dig("all", "played")
          s.won           = entry.dig("all", "win")
          s.drawn         = entry.dig("all", "draw")
          s.lost          = entry.dig("all", "lose")
          s.goals_for     = entry.dig("all", "goals", "for")
          s.goals_against = entry.dig("all", "goals", "against")
          s.points        = entry["points"]
          s.save!

SELECT "teams".* FROM "teams" WHERE "teams"."external_id" = 1 LIMIT 1
INSERT INTO "teams" ("name", "code", "flag_url", "group", "confederation", "created_at", "updated_at", "external_id") VALUES ('Belgium', 'BEL', 'https://media.api-sports.io/football/teams/1.png', NULL, NULL, '2026-06-03 00:52:01.267875', '2026-06-03 00:52:01.267875', 1) RETURNING "id"
---
  def sync_teams
    raw_teams = @api.teams
    log "Syncing #{raw_teams.length} teams..."

    raw_teams.each do |item|
      t = item["team"]
      Team.find_or_initialize_by(external_id: t["id"]).tap do |team|
        team.name     = t["name"]
        team.code     = (t["code"] || t["name"][0, 3]).upcase
        team.flag_url = t["logo"]
        team.save!

SELECT "teams".* FROM "teams" WHERE "teams"."external_id" = 1569 LIMIT 1
SELECT "teams".* FROM "teams" WHERE "teams"."external_id" = 2382 LIMIT 1
SELECT "matches".* FROM "matches" WHERE "matches"."external_id" = 855736 LIMIT 1
---
  def sync_fixture(f)
    fixture_data = f["fixture"]
    teams_data   = f["teams"]
    goals_data   = f["goals"]
    league_data  = f["league"]

    home_team = Team.find_by(external_id: teams_data.dig("home", "id"))
    away_team = Team.find_by(external_id: teams_data.dig("away", "id"))
    return unless home_team && away_team

    status = STATUS_MAP.fetch(fixture_data.dig("status", "short"), "scheduled")

    match = Match.find_or_initialize_by(external_id: fixture_data["id"])

DELETE FROM "goals" WHERE "goals"."id" = 2
SELECT "teams".* FROM "teams" WHERE "teams"."external_id" = 2382 LIMIT 1
INSERT INTO "goals" ("match_id", "team_id", "player_name", "minute", "goal_type", "created_at", "updated_at") VALUES (9, 61, 'E. Valencia', 16, 'penalty', '2026-06-03 00:52:30.832147', '2026-06-03 00:52:30.832147') RETURNING "id"
---
  def sync_goals(match, events)
    return if events.empty?
    match.goals.destroy_all

    events.select { |e| e["type"] == "Goal" }.each do |e|
      team = Team.find_by(external_id: e.dig("team", "id"))
      next unless team

      goal_type = case e["detail"]
                  when "Own Goal" then "own_goal"
                  when "Penalty"  then "penalty"
                  else "regular"
                  end

      match.goals.create!(
        team:        team,
        player_name: e.dig("player", "name") || "Unknown",
        minute:      e["time"]["elapsed"].clamp(1, 120),
        goal_type:   goal_type
      )

SELECT "teams".* FROM "teams" WHERE "teams"."external_id" = 1569 LIMIT 1
SELECT "match_stats".* FROM "match_stats" WHERE "match_stats"."match_id" = 9 AND "match_stats"."team_id" = 60 LIMIT 1
---
  def sync_stats(match, stats)
    return if stats.empty?

    stats.each do |team_stats|
      team = Team.find_by(external_id: team_stats.dig("team", "id"))
      next unless team

      stat = match.match_stats.find_or_initialize_by(team: team)