app/channels/match_channel.rb

  def subscribed
    match = Match.find_by(id: params[:match_id])
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = 4 LIMIT 1