app/controllers/api/v1/matches_controller.rb

SELECT "matches".* FROM "matches" WHERE "matches"."kickoff_at" BETWEEN '2026-06-03 00:00:00' AND '2026-06-03 23:59:59.999999'
SELECT "goals".* FROM "goals" WHERE "goals"."match_id" IN (1, 2, 3, 4, 5, 6, 7, 8)
SELECT "match_stats".* FROM "match_stats" WHERE "match_stats"."match_id" IN (1, 2, 3, 4, 5, 6, 7, 8)
SELECT "teams".* FROM "teams" WHERE "teams"."id" IN (1, 2, 5, 6, 13, 17, 28, 21)
---
      def index
        matches = case params[:filter]
        when "live"    then Match.live
        when "today"   then Match.today
        when "upcoming" then Match.upcoming.limit(20)
        else Match.order(kickoff_at: :asc)
        end

        matches = matches.includes(:home_team, :away_team, :goals, :match_stats)

SELECT "matches".* FROM "matches" WHERE "matches"."id" = 4 LIMIT 1
SELECT "teams".* FROM "teams" WHERE "teams"."id" = 6
---
      def show
        match = Match.includes(:home_team, :away_team, goals: :team, match_stats: :team).find(params[:id])