app/controllers/api/v1/standings_controller.rb

      def index
        groups = Standing.includes(:team).order(:group_name, :rank).group_by(&:group_name)
---
SELECT "standings".* FROM "standings" ORDER BY "standings"."group_name" ASC, "standings"."rank" ASC
SELECT "teams".* FROM "teams" WHERE "teams"."id" IN (57, 40, 61, 60, 38, 62, 47, 56, 51, 49, 43, 48, 33, 45, 53, 46, 39, 37, 50, 54, 55, 34, 32, 63, 35, 42, 59, 41, 52, 44, 36, 58)