app/models/match_stat.rb

SELECT "match_stats".* FROM "match_stats" WHERE "match_stats"."match_id" = 9
---
  def broadcast_stats
    ActionCable.server.broadcast("match_#{match_id}", {
      type: "stats_update",
      stats: match.match_stats.includes(:team).as_json(include: :team)
    })